### 선수 한 명 연봉

In [ ]:
import numpy as np
import pandas as pd
import random

import requests
from bs4 import BeautifulSoup
from selenium import webdriver
from fake_useragent import UserAgent

import time
import csv
import os

In [ ]:
# fake_useragent 모듈을 통한 User-Agent 정보 생성
useragent = UserAgent()
print(useragent.chrome)

path = r'C:\Users\lg\Desktop\Scraping\chromedriver_83.exe'
driver = webdriver.Chrome(executable_path=path)

name = '양현종'
birth = '1988-03-01'
id = 77637

url = 'http://www.statiz.co.kr/player.php?opt=11&name={0}&birth={1}'.format(name, birth)
driver.get(url)

# #연봉 페이지로 이동
# driver.find_element_by_css_selector('body > div.wrapper > div.content-wrapper > div > section.content > div > div:nth-child(1) > div > div.col-xs-12.col-sm-8.col-md-8.col-lg-12 > div > div.table-responsive.no-padding.box > table > tbody > tr > td > a:nth-child(9) > i').click()

In [ ]:
table = driver.find_elements_by_css_selector('table')
lines=table[0].find_elements_by_xpath('/html/body/div[1]/div[1]/div/section[2]/div/div[2]/div/div/div/div[2]/table/tbody/tr')
print(len(lines))
salary = []
for l in range(0,len(lines)) :
    text = lines[l].text
    line = text.split(" ")
    salary.append(line[:2])
print(salary)
header = salary[0]
salary = pd.DataFrame(salary[1:], columns=header)

salary['연봉(만원)'].replace(salary['연봉(만원)'][salary['연봉(만원)'].str.contains(',') ==  False]
                            ,0, inplace=True) #연봉 정보 없는 경우 WAR 들어가는 것 0으로 변환
salary.rename(columns = {'연봉(만원)' : '{0}'.format(id)}, inplace = True)
salary['연도'] = salary['연도'].astype(int)

### 선수 전체 연봉

In [98]:
import numpy as np
import pandas as pd
import random

import requests
from bs4 import BeautifulSoup
from selenium import webdriver
from fake_useragent import UserAgent

import time
import csv
import os

In [99]:
player_info = pd.read_csv('player_info.csv', encoding='euc-kr')
new_player_info = player_info.copy()

In [100]:
new_player_info.info()
print(new_player_info.head())
print(new_player_info.tail())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4501 entries, 0 to 4500
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             4501 non-null   int64
 1   playername     4501 non-null   object
 2   backno         3737 non-null   float64
 3   birthdate      4365 non-null   object
 4   position       4501 non-null   object
 5   height-weight  4501 non-null   object
 6   carrer         4351 non-null   object
 7   deposit        746 non-null    object
 8   salary         882 non-null    object
 9   pick           2175 non-null   object
 10  proYr          1905 non-null   object
dtypes: float64(1), int64(1), object(9)
memory usage: 386.9+ KB
      id playername  backno      birthdate   position height-weight  \
0  50001        강병철    80.0  1946년 08월 12일     (우투우타)    176cm/80kg
1  50002        이희수    81.0  1948년 01월 17일     (우투우타)    170cm/68kg
2  50003        이충순     NaN  1900년 01월 01일         ()       0cm/0kg
3  50004        백기성    78.0  1949년 03월 27일     (우투우타)    173cm/75kg
4  50007        문상준   107.0  2001년 03월 14일  내야수(우투우타)    183cm/80kg

             carrer deposit  salary                pick proYr
0  동신초-대신중-부산상고-우석대     NaN     NaN                 NaN   NaN
1            성남고-농협     NaN     NaN                 NaN   NaN
2               NaN     NaN     NaN                 NaN   NaN
3               배문고     NaN     NaN                 NaN   NaN
4       가동초-휘문중-휘문고  4000만원  2700만원  20 KT 2차 8라운드 72순위   NaN
         id playername  backno      birthdate   position height-weight  \
4496  99742        김병준    11.0  1977년 04월 01일   투수(우투우타)    184cm/84kg
4497  99745        방재훈    45.0  1975년 03월 03일  외야수(우투우타)    181cm/83kg
4498  99767        전하진    67.0  1979년 02월 11일   투수(우투우타)    180cm/78kg
4499  99810        이진영    72.0  1980년 06월 15일     (좌투좌타)    185cm/90kg
4500  99846        비아노    46.0  1973년 09월 04일   투수(우투우타)    180cm/82kg

                          carrer deposit salary       pick  proYr
4496                     대전고-고려대     NaN    NaN        NaN    NaN
4497                     북일고-경성대     NaN    NaN        NaN    NaN
4498                   세광고-제주관광대     NaN    NaN        NaN    NaN
4499  군산초-군산남중-군산상고-쌍방울-SK-LG-KT     NaN    NaN  99 쌍방울 1차  99쌍방울
4500                   미국 롱비치시립대     NaN    NaN        NaN    NaN

In [101]:
new_player_info['id'] = new_player_info['id'].astype(int)
new_player_info['birthdate'].replace(['년 ', '월 ', '일'],['-', '-', ''], regex=True, inplace=True)
new_player_info = new_player_info[['id', 'playername', 'birthdate']]

In [102]:
new_player_info.info()
new_player_info.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4501 entries, 0 to 4500
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4501 non-null   int32
 1   playername  4501 non-null   object
 2   birthdate   4365 non-null   object
dtypes: int32(1), object(2)
memory usage: 88.0+ KB

      id playername   birthdate
0  50001        강병철  1946-08-12
1  50002        이희수  1948-01-17
2  50003        이충순  1900-01-01
3  50004        백기성  1949-03-27
4  50007        문상준  2001-03-14

In [103]:
#생년월일 null인 행 제거
new_player_info['birthdate'].isna().sum(axis=0)
new_player_info.dropna(subset=['birthdate'], axis=0, inplace=True)
new_player_info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4365 entries, 0 to 4500
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4365 non-null   int32
 1   playername  4365 non-null   object
 2   birthdate   4365 non-null   object
dtypes: int32(1), object(2)
memory usage: 119.4+ KB

In [104]:
new_player_info.info()
print(new_player_info.head())
print(new_player_info.tail())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4365 entries, 0 to 4500
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4365 non-null   int32
 1   playername  4365 non-null   object
 2   birthdate   4365 non-null   object
dtypes: int32(1), object(2)
memory usage: 119.4+ KB
      id playername   birthdate
0  50001        강병철  1946-08-12
1  50002        이희수  1948-01-17
2  50003        이충순  1900-01-01
3  50004        백기성  1949-03-27
4  50007        문상준  2001-03-14
         id playername   birthdate
4496  99742        김병준  1977-04-01
4497  99745        방재훈  1975-03-03
4498  99767        전하진  1979-02-11
4499  99810        이진영  1980-06-15
4500  99846        비아노  1973-09-04

In [106]:
total = pd.DataFrame(range(1997,2021), columns=['연도'])

# fake_useragent 모듈을 통한 User-Agent 정보 생성
useragent = UserAgent()
print(useragent.chrome)

path = r'C:\kkang\dev-tool\chromedriver.exe'
driver = webdriver.Chrome(executable_path=path)

for r in range(5):
    for a,b,c in [new_player_info.iloc[r,:]] : 
        #print(a,b,c) #a:id b:이름 c:생년월일
        url = 'http://www.statiz.co.kr/player.php?opt=11&name={0}&birth={1}'.format(b,c)
        driver.get(url)
        time.sleep(2)       

        try :
            table = driver.find_elements_by_css_selector('table')
            lines=table[0].find_elements_by_xpath('/html/body/div[1]/div[1]/div/section[2]/div/div[2]/div/div/div/div[2]/table/tbody/tr')
            print(len(lines))


            salary = []
            for l in range(0,len(lines)) :
                text = lines[l].text
                line = text.split(" ")
                salary.append(line[:2])
            print(len(salary))

            header = salary[0]
            salary = pd.DataFrame(salary[1:], columns=header)
            salary['연봉(만원)'].replace(salary['연봉(만원)'][salary['연봉(만원)'].str.contains(',') ==  False]
                                        ,int(0), inplace=True) #연봉 정보 없는 경우 WAR 들어가는 것 0으로 변환
            salary.rename(columns = {'연봉(만원)' : '{0}'.format(a)}, inplace = True)
            salary['연도'] = salary['연도'].astype(int)

            total = total.merge(salary,how='left')
            print(total)

        except IndexError :
            print(b,'error')
            pass 
        r_number = random.randint(1,30)
        time.sleep(r_number)       

driver.quit()

total.info()
print(total.head())

..      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
11  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
12  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
13  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
14  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
15  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
16  ...      NaN      NaN    NaN   NaN    NaN      NaN     NaN      NaN
17  ...  900,000      NaN  2,400   NaN  2,400      NaN   2,400  900,000
18  ...      NaN      NaN    NaN   NaN    NaN      NaN  16,000      NaN
19  ...      NaN      NaN    NaN   NaN    NaN      NaN  16,000      NaN
20  ...      NaN      NaN    NaN   NaN  2,800  900,000  22,000      NaN
21  ...      NaN  900,000    NaN   NaN  3,000      NaN  32,000      NaN
22  ...      NaN      NaN    NaN   0.0  3,000      NaN  32,000      NaN
23  ...      NaN      NaN    NaN   0.0  3,500      NaN  32,000      NaN

    64346  64350
0     NaN    NaN
1     NaN    NaN
2     NaN    NaN
3     NaN    NaN
4     NaN    NaN
5     NaN    NaN
6     NaN    NaN
7     NaN    NaN
8     NaN    NaN
9     NaN    NaN
10    NaN    NaN
11    NaN    NaN
12    NaN    NaN
13    NaN    NaN
14    NaN    NaN
15    NaN    NaN
16    NaN    NaN
17    NaN  2,400
18  4,000  5,500
19  4,000  5,500
20  6,500  6,000
21  5,000  5,500
22  5,000    NaN
23  5,000    NaN

[24 rows x 406 columns]
2
[['연도', '연봉(만원)'], ['2015', '900,000']]
      연도  50030  50036   50040  50054  50066  50126  50150  50157   50165  \
0   1997    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
1   1998    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
2   1999    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
3   2000    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
4   2001    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
5   2002    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
6   2003    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
7   2004    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
8   2005    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
9   2006    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
10  2007    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
11  2008    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
12  2009    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
13  2010    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
14  2011    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
15  2012    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
16  2013    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
17  2014    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
18  2015    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
19  2016    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
20  2017    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
21  2018    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
22  2019    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
23  2020  2,700  2,700  45,000  2,700  2,700  2,700  2,700  2,700  30,000

    ...    64255  64259 64260  64266    64267   64300    64302  64346  64350  \
0   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
1   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
2   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
3   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
4   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
5   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
6   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
7   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
8   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
9   ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
10  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
11  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
12  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
13  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
14  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
15  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
16  ...      NaN    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN
17  ...      NaN  2,400   NaN  2,400      NaN   2,400  900,000    NaN  2,400
18  ...      NaN    NaN   NaN    NaN      NaN  16,000      NaN  4,000  5,500
19  ...      NaN    NaN   NaN    NaN      NaN  16,000      NaN  4,000  5,500
20  ...      NaN    NaN   NaN  2,800  900,000  22,000      NaN  6,500  6,000
21  ...  900,000    NaN   NaN  3,000      NaN  32,000      NaN  5,000  5,500
22  ...      NaN    NaN   0.0  3,000      NaN  32,000      NaN  5,000    NaN
23  ...      NaN    NaN   0.0  3,500      NaN  32,000      NaN  5,000    NaN

      64354
0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
8       NaN
9       NaN
10      NaN
11      NaN
12      NaN
13      NaN
14      NaN
15      NaN
16      NaN
17      NaN
18  900,000
19      NaN
20      NaN
21      NaN
22      NaN
23      NaN

[24 rows x 407 columns]
안영태 error
박병훈 error
김광영 error
이재림 error
2
[['연도', '연봉(만원)'], ['2016', '2,700']]
      연도  50030  50036   50040  50054  50066  50126  50150  50157   50165  \
0   1997    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
1   1998    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
2   1999    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
3   2000    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
4   2001    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
5   2002    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
6   2003    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
7   2004    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
8   2005    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
9   2006    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
10  2007    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
11  2008    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
12  2009    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
13  2010    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
14  2011    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
15  2012    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
16  2013    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
17  2014    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
18  2015    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
19  2016    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
20  2017    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
21  2018    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
22  2019    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
23  2020  2,700  2,700  45,000  2,700  2,700  2,700  2,700  2,700  30,000

    ...  64259 64260  64266    64267   64300    64302  64346  64350    64354  \
0   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
1   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
2   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
3   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
4   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
5   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
6   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
7   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
8   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
9   ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
10  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
11  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
12  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
13  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
14  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
15  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
16  ...    NaN   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN
17  ...  2,400   NaN  2,400      NaN   2,400  900,000    NaN  2,400      NaN
18  ...    NaN   NaN    NaN      NaN  16,000      NaN  4,000  5,500  900,000
19  ...    NaN   NaN    NaN      NaN  16,000      NaN  4,000  5,500      NaN
20  ...    NaN   NaN  2,800  900,000  22,000      NaN  6,500  6,000      NaN
21  ...    NaN   NaN  3,000      NaN  32,000      NaN  5,000  5,500      NaN
22  ...    NaN   0.0  3,000      NaN  32,000      NaN  5,000    NaN      NaN
23  ...    NaN   0.0  3,500      NaN  32,000      NaN  5,000    NaN      NaN

    64396
0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    NaN
14    NaN
15    NaN
16    NaN
17    NaN
18    NaN
19  2,700
20    NaN
21    NaN
22    NaN
23    NaN

[24 rows x 408 columns]
우준석 error
정윤기 error
이희웅 error
박제윤 error
전경환 error
김희준 error
4
[['연도', '연봉(만원)'], ['2018', '2,800'], ['2019', '2,800'], ['2020', '4,000']]
      연도  50030  50036   50040  50054  50066  50126  50150  50157   50165  \
0   1997    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
1   1998    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
2   1999    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
3   2000    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
4   2001    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
5   2002    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
6   2003    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
7   2004    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
8   2005    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
9   2006    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
10  2007    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
11  2008    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
12  2009    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
13  2010    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
14  2011    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
15  2012    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
16  2013    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
17  2014    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
18  2015    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
19  2016    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
20  2017    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
21  2018    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
22  2019    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
23  2020  2,700  2,700  45,000  2,700  2,700  2,700  2,700  2,700  30,000

    ... 64260  64266    64267   64300    64302  64346  64350    64354  64396  \
0   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
1   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
2   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
3   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
4   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
5   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
6   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
7   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
8   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
9   ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
10  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
11  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
12  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
13  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
14  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
15  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
16  ...   NaN    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN
17  ...   NaN  2,400      NaN   2,400  900,000    NaN  2,400      NaN    NaN
18  ...   NaN    NaN      NaN  16,000      NaN  4,000  5,500  900,000    NaN
19  ...   NaN    NaN      NaN  16,000      NaN  4,000  5,500      NaN  2,700
20  ...   NaN  2,800  900,000  22,000      NaN  6,500  6,000      NaN    NaN
21  ...   NaN  3,000      NaN  32,000      NaN  5,000  5,500      NaN    NaN
22  ...   0.0  3,000      NaN  32,000      NaN  5,000    NaN      NaN    NaN
23  ...   0.0  3,500      NaN  32,000      NaN  5,000    NaN      NaN    NaN

    64407
0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    NaN
14    NaN
15    NaN
16    NaN
17    NaN
18    NaN
19    NaN
20    NaN
21  2,800
22  2,800
23  4,000

[24 rows x 409 columns]
백종헌 error
4
[['연도', '연봉(만원)'], ['2018', '2,700'], ['2019', '2,700'], ['2020', '4,500']]
      연도  50030  50036   50040  50054  50066  50126  50150  50157   50165  \
0   1997    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
1   1998    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
2   1999    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
3   2000    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
4   2001    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
5   2002    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
6   2003    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
7   2004    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
8   2005    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
9   2006    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
10  2007    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
11  2008    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
12  2009    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
13  2010    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
14  2011    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
15  2012    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
16  2013    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
17  2014    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
18  2015    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
19  2016    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
20  2017    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
21  2018    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
22  2019    NaN    NaN     NaN    NaN    NaN    NaN    NaN    NaN     NaN
23  2020  2,700  2,700  45,000  2,700  2,700  2,700  2,700  2,700  30,000

    ...  64266    64267   64300    64302  64346  64350    64354  64396  64407  \
0   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
1   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
2   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
3   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
4   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
5   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
6   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
7   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
8   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
9   ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
10  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
11  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
12  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
13  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
14  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
15  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
16  ...    NaN      NaN     NaN      NaN    NaN    NaN      NaN    NaN    NaN
17  ...  2,400      NaN   2,400  900,000    NaN  2,400      NaN    NaN    NaN
18  ...    NaN      NaN  16,000      NaN  4,000  5,500  900,000    NaN    NaN
19  ...    NaN      NaN  16,000      NaN  4,000  5,500      NaN  2,700    NaN
20  ...  2,800  900,000  22,000      NaN  6,500  6,000      NaN    NaN    NaN
21  ...  3,000      NaN  32,000      NaN  5,000  5,500      NaN    NaN  2,800
22  ...  3,000      NaN  32,000      NaN  5,000    NaN      NaN    NaN  2,800
23  ...  3,500      NaN  32,000      NaN  5,000    NaN      NaN    NaN  4,000

    64410
0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    NaN
14    NaN
15    NaN
16    NaN
17    NaN
18    NaN
19    NaN
20    NaN
21  2,700
22  2,700
23  4,500

[24 rows x 410 columns]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 24 entries, 0 to 23
Columns: 410 entries, 연도 to 64410
dtypes: float64(79), int64(1), object(330)
memory usage: 77.1+ KB
     연도 50030 50036 50040 50054 50066 50126 50150 50157 50165  ... 64266  \
0  1997   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...   NaN
1  1998   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...   NaN
2  1999   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...   NaN
3  2000   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...   NaN
4  2001   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  ...   NaN

  64267 64300 64302 64346 64350  64354  64396  64407  64410
0   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN
1   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN
2   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN
3   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN
4   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN

[5 rows x 410 columns]